Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཡོངས་སུ་བསྔོ་བ་ནི་རྣམ་པ་བཞིས་མི་རིགས་ཏེ། རྗེས་སུ་ཡི་རང་བའི་སེམས་དང་ཡོངས་སུ་བསྔོ་བའི་སེམས་གཉིས་ཕྲད་པ་མེད་པ་དང་། དངོས་པོ་ལ་དམིགས་པ་དང་། དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་བྱ་བའི་དངོས་པོ་རྣམས་ཕྲད་པ་མེད་པ་དང་།
en: Fashioning causal signs and making the dedication is illogical in four ways: there is no connection between the two—the rejoicing thought and the dedicating thought; there is no connection between apprehending the basis, the wholesome root, and the basis of the meritorious action; there is no connection between the two— the dedication and to what the dedication is being made; and there is no dedication. “

source: བསྔོ་བ་དང་། ཡོངས་སུ་བསྔོ་བར་བྱ་བ་གཉིས་ཕྲད་པ་མེད་པ་དང་། ཡོངས་སུ་བསྔོ་བ་ཡང་མེད་པའི་ཕྱིར་ཏེ། སེམས་གང་གིས་རྗེས་སུ་ཡི་རང་ཞིང་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པའི་སེམས་དེ་ནི་ཟད་ཅིང་འགགས་ལ་མེད་དེ་རྣམ་པར་འགྱུར་ཞེས་བྱ་བས་ནི་སེམས་གཉིས་ཕྲད་པ་མེད་པར་སྟོན་ཏོ།
en: The thought that does the rejoicing and dedication” of the wholesome roots to unsurpassed, perfect, complete awakening “is a thought that is extinguished, stopped, nonexistent, and has run out” teaches that there is no connection between the two thoughts. “

source: །དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱས་པའི་དངོས་པོ་དེ་ཡང་ཟད་ཅིང་འགག་པ་མེད་དེ། རྣམ་པར་གྱུར་པ་ཡིན་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དངོས་པོ་ལ་སོགས་པ་མེད་པར་སྟོན་ཏོ།
en: And those entities and those objective supports, those wholesome roots, and those bases of meritorious action arisen from rejoicing are extinguished, stopped, nonexistent, and have run out,” and so on, teaches that there are no “entities” and so on. “

source: །ཅི་སེམས་ཀྱིས་སེམས་ཡོངས་སུ་བསྔོ་འམ།
en: Does thought dedicate thought?

source: གལ་ཏེ་སེམས་ཀྱིས་སེམས་ཡོངས་སུ་བསྔོར་ནི་སེམས་ཕྲད་པར་འགྱུར་བ་མེད་དེ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་བསྔོ་བ་དང་། ཡོངས་སུ་བསྔོ་བར་བྱ་བ་གཉིས་མེད་པར་སྟོན་ཏོ།
en: If thought were to dedicate thought, there would be no coming together of two thoughts” teaches that there is no connection between the two—the dedication and to what the dedication is being made. “

source: །སེམས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ་ཞེས་བྱ་བས་ནི་ཡོངས་སུ་བསྔོ་བའི་སེམས་མེད་པར་སྟོན་ཏེ།
en: The intrinsic nature of thought cannot be dedicated” teaches that there is no thought making the dedication.

source: སེམས་དེ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པས་བརྟགས་པ་སྟེ་དངོས་པོ་མེད་པ་ནི་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It teaches that thought is a construction because of the nonexistence of its intrinsic nature, and nonexistence cannot make a dedication. “

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དངོས་པོ་མེད་པའོ་ཞེས་བྱ་བར་ཤེས་ན་ཞེས་བྱ་བར་ལ་སོགས་པ་ནི་དངོས་པོ་མེད་པའི་མཚན་ཉིད་སྟོན་ཏོ།
en: When bodhisattva great beings practicing the perfection of wisdom thus know the perfection of wisdom is a nonexistent thing,” and so on, teaches that it is characterized as a nonexistent thing. “

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཞེས་བྱ་བ་ལ་སོགས་པས་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་རྗེས་སུ་ཡི་རང་བ་དང་།
en: The bodhisattva Maitreya then asked the elder Subhūti, “Venerable monk Subhūti, when bodhisattva great beings who have newly set out in the vehicle,” and so on.

source: ཡོངས་སུ་བསྔོ་བ་གཉིས་ཀྱི་ངོ་བོ་ཉིད་དྲིས་སོ།
en: He is asking what the rejoicing and dedication of those who have newly set out are.

source: །ཡང་བྱམས་པ་གལ་ཏེ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་རབ་འབྱོར་གྱིས། དེས་ཀྱང་བསླབ་པའི་དབང་གིས་མི་དམིགས་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་བྱའོ་ཞེས་སྟོན་ཏོ།
en: And with “when bodhisattvas… who have newly set out in the vehicle,” and so on, Subhūti teaches Maitreya that they have to do it based on training “by way of not apprehending anything.” “

source: །དེས་བདུད་ཀྱི་ལས་དེ་དག་ཐོས་ནས་འགྲིབ་པའམ་འཕེལ་བ་མེད་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་དེ་དག་ཏུ་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་རོ།
en: And, having heard about those works of Māra from them, no decrease happens and no increase happens,” because of the absence of constructing those in thought. “

source: །བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཡིད་ལ་བྱེད་པའོ།
en: Grasp the bodhisattva lineage”— pay attention to suchness.

source: །དེའི་འོག་ཏུ་སྤྱིར་རྗེས་སུ་ཡི་རང་བའི་རྣམ་གྲངས་བསྟན་ནས། དེའི་འོག་ཏུ་བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལམ་གྱི་རྒྱུན་བཅད་པ། སྤྲོས་པ་དང་སྲིད་པའི་ཚུལ་གྱིས་རྒྱུན་བཅད་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་དོན་དམ་པར་བཤད་པའི་སྐབས་འབྱེད་དོ།
en: Then, having taught one of the many explanations of rejoicing in general, it sets the scene for the ultimate explanation with, “Furthermore, Maitreya, bodhisattva great beings who have newly set out in the vehicle should compress together the merit accumulations and the wholesome roots planted by the lord buddhas whose path has come to an end, whose thought constructions and cravings for existence have been cut off,” and so on.

source: །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་དེ་ལ་ཇི་ལྟར་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་བ་དྲིས་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཡོངས་སུ་བསྔོ་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་འགྲེས་རྣམ་པ་དགུ་བསྟན་ཏེ།
en: Then Maitreya asks him how do they not go wrong and then the elder Subhūti teaches a section on dedication free of basic immorality, ninefold.

source: དེ་ལ་འདུ་ཤེས་རྣམ་པ་དྲུག་མེད་པས། ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་གྱི་དེ་ལས་གཞན་དུ་ན་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་འགྲེས་དང་པོའོ།
en: There, the first section is that dedication is not wrong based on the absence of the six perceptions, but otherwise it will be wrong.

source: །སངས་རྒྱས་ལ་སོགས་པ་ལ་སེམས་པའི་སེམས་དང་ཡོངས་སུ་བསྔོ་བའི་སེམས་ཀྱང་ཟད་པ་དང་། བྱང་ཆུབ་ཀྱང་མེད་པ་དང་། ཆོས་རྣམས་ཀྱང་ངོ་བོ་ཉིད་ཀྱི་སྟོང་པ་ཉིད་དང་། ཡོངས་སུ་བསྔོ་བ་ཡང་མེད་པའི་ཕྱིར། དོན་དམ་པར་ཡོངས་སུ་བསྔོ་བ་མེད་དོ་ཞེས་དེ་ལྟར་སེམས་ན་མཐུན་པར་ཡོངས་སུ་བསྔོ་བ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་འགྲེས་གཉིས་པའོ།
en: The second section is where it says “it is a conforming dedication,” if they contemplate like this: ultimately there is no dedication because thinking about the thought of buddhas and so on, as well as the thought of the dedication, “are extinguished”— even awakening is nonexistent, dharmas are empty of an intrinsic nature, and dedication is nonexistent as well.

source: །དེ་ནས་ཡང་འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཉན་ཐོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། སངས་རྒྱས་རྣམས་དང་། སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་གང་ཡིན་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་ནས་ཡོངས་སུ་བསྔོ་བ་ན། དེ་དག་ཟད་པར་ཡིད་ལ་བྱེད་པ་དང་། ཡོངས་སུ་བསྔོ་བ་མེད་པར་ཡིད་ལ་བྱེད་པ་དང་། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཡིན་པར་ཡིད་ལ་བྱེད་པ་ན་བླ་ན་མེད་པའི་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོ་ཞིང་ཞེས་བྱ་བ་ནི་གསུམ་པའོ།
en: Then the third is where it says if, having rejoiced in the merits, whatever they may be, of all “past, future, and present” śrāvakas, bodhisattvas, buddhas, and ordinary beings, “they rejoice in them and dedicate them, paying attention to their being” extinguished, “paying attention to there being no dedication, and paying attention to the” emptiness of an intrinsic nature, “by that dedication they” dedicate to unsurpassed, perfect, complete awakening.

source: །དེ་ནས་ཡང་ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དེ། ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་པ་ཉིད་དང་ཆོས་ཐམས་ཅད་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པར་ཤེས་ཤིང་མཆོག་ནས་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོ་ན་ཞེས་བྱ་བ་ནི་བཞི་པའོ། །དེ་ནས་ཡང་སྔ་མ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་ནས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་ན། སངས་རྒྱས་རྣམས་དང་། ཉན་ཐོས་དང་།
en: Then the fourth is where it says when they “are aware that the piling up of” the merit from dedication is isolated from all dharmas, and all dharmas are isolated from an intrinsic nature, they dedicate with “the best, up to the equal to the unequaled dedication.”

source: རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དགེ་བའི་རྩ་བ་རྣམས་དང་། ཡོངས་སུ་བསྔོ་བ་དང་། བྱང་ཆུབ་དང་ཡོངས་སུ་བསྔོ་བའི་སེམས་དེ་དག་གིས་ངོ་བོ་ཉིད་མཚུངས་པར་ཤེས་ནས་ཡོངས་སུ་བསྔོ་ན་ཞེས་བྱ་བ་ནི་ལྔ་པའོ།
en: Then the fifth, as before, is where it says that when they rejoice in the wholesome roots and dedicate them, they dedicate while aware that the śrāvakas, pratyekabuddhas, bodhisattvas, wholesome roots, dedication, awakening, and the thought doing the dedication are the same in their intrinsic nature.

source: །དེའི་འོག་ཏུ་དགེ་བའི་རྩ་བ་རྣམས་ལ་མཚན་མར་བྱས་ཏེ། ཡོངས་སུ་བསྔོ་ཞིང་འདས་པའི་སངས་རྒྱས་རྣམས་ལ་ཡང་འདས་པའི་ཡིད་ལ་བྱེད་པས་མཚན་མར་བྱེད་ཅིང་ཡུལ་ཡིན་པར་ཡིད་ལ་བྱེད་ན་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ། །གལ་ཏེ་དགེ་བའི་རྩ་བ་དེ་དག་དང་། མངོན་པར་འདུ་བྱེད་པ་དེ་དག་དང་། སེམས་བསྐྱེད་པ་དེ་དག་ཤེས་པར་མི་བྱེད་ཅིང་ཚད་མར་མི་བྱེད་ན་དེ་ཡང་དག་པར་བསྔོ་བ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དྲུག་པའོ།
en: Then the sixth is where it says that when they fashion a causal sign for the wholesome roots and dedicate them, and, by paying attention to past buddhas as past, fashion a causal sign for them and pay attention to them as an object, it becomes wrong, but when “they do not form a knowledge of and do not give validity to those wholesome roots, those accumulations, or those productions of the thought,” they dedicate perfectly.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་མཚན་མར་མི་བྱེད་པ་དང་།
en: Then the seventh is the section of the dedication that has not been poisoned.

source: ཡོངས་སུ་བསྔོ་བ་གཉིས་མི་འགལ་བར་ཇི་ལྟར་རུང་སྙམ་ནས་དྲིས་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་རྣམས་ཀྱི་ཡིན་ནོ་ཞེས་བྱ་བ་བསྟན་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་བསྟན་ཏེ།
en: This is where the bodhisattva Maitreya, thinking how is it possible that the two—not fashioning a causal sign and dedication—are not a contradiction, asks the elder Subhūti, who then teaches that it is when the dedication is made by “bodhisattvas who are skilled.”

source: དེ་ལ་ཡང་དག་པར་ཡོངས་སུ་བསྔོ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། སངས་རྒྱས་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། མངོན་པར་འདུ་བྱ་བ་དེ་དག་དང་། སེམས་དེ་དག་ཀྱང་ཡོད་པ་མ་ཡིན་ན།
en: Then the bodhisattva Maitreya teaches that bodhisattvas who want to make a perfect dedication “should reflect deeply as follows: … those buddhas, those wholesome roots, those accumulations, and those… thoughts” do not exist; nevertheless, look how having fashioned causal signs I construct them all in my mind.

source: འོན་ཀྱང་བདག་ནི་དེ་དག་ཐམས་ཅད་མཚན་མར་བྱས་ནས་རྣམ་པར་རྟོག་པ་ལྟ་ཞིག །དེ་ལྟར་མཚན་མར་བྱས་ཤིང་རྣམ་པར་རྟོག་པས་ཡོངས་སུ་བསྔོ་བ་ནི་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་གནང་བ་མ་མཛད་དེ།
en: Tathāgatas do not permit such a dedication where, having fashioned such causal signs, they conceptualize them.

source: དེ་ནི་ཁ་ཟས་ཞིམ་པོ་དུག་དང་མཚུངས་སོ།
en: It is similar to a delicacy that has been poisoned.

source: །དེ་བས་ན་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་ཞིང་དེ་ལ་བསླབ་པར་ཡང་མི་བྱའོ།
en: So such a dedication should not be made, and training should not be done in that.

source: །དེ་བས་ན་སངས་རྒྱས་ཉིད་ཚད་མར་བྱས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་དག་ཐམས་ཅད་ཇི་ལྟར་མཁྱེན་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཡོངས་སུ་བསྔོའོ་ཞེས་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དུག་མེད་པའི་ཡོངས་སུ་བསྔོ་བའི་འགྲེས་ནི་བདུན་པའོ།
en: Therefore, having taken the Buddha alone as authority, they make a dedication, thinking, “I shall dedicate those wholesome roots just as the lord buddhas understand them.”

source: །དེ་ནས་ཆོས་ཐམས་ཅད་ཁམས་གསུམ་དང་དུས་གསུམ་དུ་མ་གཏོགས་པར་ཡིད་ལ་བྱེད་པས་ཡོངས་སུ་བསྔོ་བ་ནི་དུག་མེད་པའོ།
en: Then the eighth is where it says dedication while paying attention to all dharmas that do not belong to the three realms and three time periods “has not been poisoned.”

source: །དེ་ལས་གཞན་དུ་ཡོངས་སུ་བསྔོ་བ་ནི་དུག་དང་བཅས་པའོ་ཞེས་བྱ་བ་ནི་བརྒྱད་པའོ།
en: Dedication other than that “has been poisoned.”

source: །དེ་ནས་ཡང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་གྱི་ཆོས་ཉིད་ཀྱིས་བདག་ཡོངས་སུ་བསྔོ་བར་བྱའོ་ཞེས་བྱ་བ་ནི་དགུ་པའོ།
en: And then the ninth is where it says “I too must dedicate… in this truly dharmic way,” which is the domain of the transcendental knowledge of the buddhas.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚིག་ལས་རྣམ་པ་མང་དུ་རྗེས་སུ་ཡི་རང་བར་མཛད་ནས་རྣམ་པ་གསུམ་གྱིས་བསོད་ནམས་མང་དུ་འཕེལ་བར་བསྟན་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Then the Lord, having rejoiced in many ways in those statements, gives a threefold teaching about greatly increasing merit.

source: མངོན་པར་ཤེས་པ་ཐོབ་པ་རྣམས་ཀྱི་བསོད་ནམས་པས་ཆགས་པ་མེད་པའི་ཡོངས་སུ་བསྔོ་བ་འདི་བསོད་ནམས་ཆེས་མང་ངོ་ཞེས་བྱ་བ་ནི་གཅིག་གོ།
en: The first is “this dedication… without attachment creates even more merit than” the merit “if all the beings that are in the billionfold world system were to obtain the ten wholesome actions… the concentrations, … the immeasurables, … the absorptions, and… the clairvoyances.”

source: །དེ་ལ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ནས། དགྲ་བཅོམ་པ་དང་། རང་བྱང་ཆུབ་ཀྱི་བར་དུ་གྱུར་པ་རྣམས་ལ་རྐྱེན་བཞིས་ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བྱས་པའི་བསོད་ནམས་པས་ལྷག་པ་ཞེས་བྱ་བ་ནི་གཉིས་པའོ།
en: The second is that one has even more than the merit created from having served those beings if they “were to become stream enterers,” and so on, up to “worthy ones and pratyekabuddhas,” with the four necessities for as long as they live.

source: །དེ་ཉིད་ལ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་རྣམས་ལ་ཕྱོགས་བཅུའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དེ་དག་རེ་རེ་ལ་ཡང་རྐྱེན་བཞི་དང་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བསྙེན་བཀུར་བྱས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ལྟ་བུ་དེ་དག་པས་ཀྱང་ལྷག་གོ་ཞེས་བྱ་བ་ནི་གསུམ་པའོ།
en: And the third is, were all those beings to have become bodhisattvas, just that same one has even more than the masses of merit such as those created by all the beings in the ten directions were they to have served each of them with the four necessities and “with all the requirements for happiness… for as many eons as there are sand particles in the Gaṅgā River.” “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དེ་ལ་གཟུགས་མཆིས་སུ་ལགས་ན་ནི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཡང་མི་ཤོང་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་དེར་ཀུན་མི་ཆུད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Lord, if that basis of meritorious action had a physical form it would not fit in even as many world systems as there are sand particles in the Gaṅgā River” means all of it would not fit there.

source: །དེའི་འོག་ཏུ་བསོད་ནམས་སྔ་མ་རྣམས་ནི་མཚན་མའི་འདུ་ཤེས་དང་། དམིགས་པའི་འདུ་ཤེས་ཅན་ཡིན་པས་དམན་པ་ཡིན་གྱི་ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་ནི་དེ་དག་མེད་པའི་ཕྱིར་དེ་བས་ལྷག་གོ་ཞེས་བྱ་བའི་འགྲེས་དང་།
en: Then there is a section on earlier merits being inferior because they have the perception of a causal sign and “a perception that apprehends something,” and masses of dedication merits being greater than them because they do not exist.

source: དེའི་འོག་ཏུ་འདོད་པ་ན་སྤྱོད་པ་ལྷའི་བདག་པོ་ཐམས་ཅད་དང་། ལྷ་རྣམས་དང་ཚངས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པ་བྱས་པ་དང་། རབ་ཏུ་བསྔགས་པ་བརྗོད་པའི་འགྲེས་གཉིས་དང་། དེའི་འོག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་རྣམས་ཀྱི་དམིགས་པ་དང་བཅས་པར་ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་བས་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་གི་མི་དམིགས་པར་ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལྷག་པར་ཆེ་བ་བསྟན་པའི་འགྲེས་སོ།
en: Then there are two sections where all the chiefs of the gods and gods living in the desire realm, and all the Brahmās in the higher realms, have worshiped and raised their voices in praise, and then the section teaching that the merit of a single bodhisattva who dedicates while not apprehending anything is much greater than the merit from the dedication by way of apprehending something by “all the beings in a billionfold world system” who have become bodhisattvas.

source: །མི་ལེན་མི་གཏོང་། མི་རློམ་མི་བརྙས་ཤིང་དམིགས་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་དེ་རྣམས་དང་དགེ་བའི་རྩ་བ་རྣམས་དེ་བཞིན་ཉིད་དུ་དམན་པ་དང་ལྷག་པ་མེད་པའི་དོན་གྱི་དབང་གིས་མཉམ་པ་ཉིད་དུ་བསྟན་པའོ། །དེ་བཞིན་དུ་སྐྱེ་བ་དང་། འགག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་ལ་སོགས་པ་མེད་པའི་ཕྱིར་ཇི་ལྟར་སངས་རྒྱས་རྣམས་དང་། ཉན་ཐོས་དང་།
en: The first rejoicing is “without grasping, without rejecting, without falsely projecting, without acquiring, and without apprehending,” which teaches the sameness of those buddhas and those wholesome roots based on the fact that there is no worse or better in suchness.

source: རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། སོ་སོའི་སྐྱེ་བོ་དེ་དག་དང་། དགེ་བའི་རྩ་བ་རྣམས་དང་། ཡོངས་སུ་བསྔོ་བའི་སེམས་ཀྱང་དེ་བཞིན་ཉིད་ལ་སོགས་པ་ལ་གནས་པ་དེ་བཞིན་དུ་བདག་ཀྱང་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་བྱ་བ་ནི་རྗེས་སུ་ཡི་རང་བ་གཅིག་པའོ། །དེ་ནས་ཡང་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བར་མཚུངས་ཏེ།
en: Similarly, because “there is no production, cessation, defilement, purification,” and so on, “I also rejoice,” just like those buddhas, śrāvakas, pratyekabuddhas, bodhisattvas, and ordinary beings, and the wholesome roots, and the dedicating thought that all abide in suchness.

source: དེ་དང་མཚུངས་པས་ཆོས་ཐམས་ཅད་མཉམ་པའོ། །ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའི་ཕྱིར་སྔོན་སོ་སོའི་སྐྱེ་བོའི་ཚེ་མ་བཅིངས་མ་གྲོལ་བའོ། །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་དག་པའི་ཕྱིར་སྔར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། ཕྱིས་རྣམ་པར་བྱང་བ་མེད་པའོ། །ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་ཞི་བའི་ཕྱིར་སྔར་རྒྱུ་དང་རྐྱེན་གྱི་དབང་གིས་སྐྱེ་བ་མེད་དོ། །ངོ་བོ་ཉིད་མེད་པས་འབྱུང་བ་མེད་དོ། །ཕྱིས་འགག་པ་མེད་ཅིང་འཕོ་བ་མེད་པ་དང་འཇིག་པ་མེད་དོ། །དེ་ལྟར་བཅིངས་པ་དང་གྲོལ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: Then the second is also rejoicing while understanding analytically that all dharmas are comparable to “liberation,” which is to say, all dharmas are the same because they are comparable to that; because all dharmas are isolated from an intrinsic nature, so earlier at the stage of ordinary beings they “are not bound, are not freed”; because all dharmas that are pure in their basic nature “are not defiled” earlier and “are not purified” later; because all dharmas that are primordially calm “are not produced” through the power of earlier causes and conditions; because they have no intrinsic nature, “do not appear,” and later “do not stop… have not changed places, and have not been destroyed”— thus all dharmas are the same because “they are not bound, are not freed, are not defiled, and are not purified, … are not produced, do not appear, and do not stop, have not changed places, and have not been destroyed.”

source: རྣམ་པར་བྱང་བ་མེད་པ་དང་། སྐྱེ་བ་དང་འབྱུང་བ་དང་འགག་པ་མེད་པ་དང་། འཕོ་བ་དང་འཇིག་པ་མེད་པས་ཆོས་ཐམས་ཅད་མཉམ་མོ་ཞེས་སོ་སོར་རྟོག་ཅིང་རྗེས་སུ་ཡི་རང་བ་ནི་གཉིས་པའོ། །དེ་ནས་ཡང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ལ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དང་། དམིགས་པ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གིས་བསོད་ནམས་བསགས་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་བསྔོ་བའི་བསོད་ནམས་ཆེ་བར་བསྟན་པའི་འགྲེས་ཏེ།
en: Then there is the section teaching that the merit from dedicating the aggregates of morality from “practicing the perfections… by way of not apprehending anything” is greater than merit accumulated from having served all the buddhas in the ten directions with all the requirements for happiness and by practicing the six perfections together with apprehending something.

source: འདི་དག་ནི་རྗེས་སུ་ཡི་རང་བའི་འགྲེས་སོ།
en: These are the sections of the text on rejoicing.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཆོད་པ་དང་བཀླགས་པ་དང་སྦྱིན་པ་ལ་སོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བ་དང་། ཡོངས་སུ་བསྔོས་པའི་བསོད་ནམས་རྒྱ་ཆེན་པོ་ཐོས་ནས་གནས་བརྟན་ཤཱ་རིའི་བུ་དད་པ་སྐྱེས་ཏེ་འཁོར་གཞན་རྣམས་དད་པ་བསྐྱེད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པའི་སླད་དུ་སྣང་བར་བགྱིད་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཚིག་བཅུ་བདུན་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བསྟོད་པ་ལ་བརྩམས་སོ།
en: Explanation of Chapters 34 to 36 Wheel of the Dharma and the perfection of wisdom Then Śāriputra, feeling faith after having heard about the vast merit from rejoicing in, and dedication of, such worship and reciting of the perfection of wisdom, and from giving and so on, begins with seventeen statements in praise of this perfection of wisdom, to generate faith in others in the retinue. “

source: །ལན་གསུམ་དུ་བཟླས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་བའོ་ཞེས་བྱ་བ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་བདེན་པ་བཞིའི་ཆོས་ཀྱི་འཁོར་ལོ་ལན་གསུམ་དུ་བཟླས་ཏེ་རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་ཞེས་བྱའོ། །དེ་ལ་འདི་ནི་ལན་གསུམ་དུ་བཟླས་ནས་བསྐོར་བ་སྟེ།
en: Turning the wheel of the Dharma that has twelve aspects three times”— the Lord turned “the wheel of the Dharma” of the four truths “that has twelve aspects three times.”

source: འདི་ནི་བདེན་པ་བཞིའོ་ཞེས་བྱ་བར་བདེན་པ་བཞིའི་ངོ་བོ་ཉིད་ཀྱི་ལེའུ་ཚིག་ནི་གཅིག་གོ།
en: There he turns it three times: One is: “These are the four truths.” It is the part of the speech stating the intrinsic nature of the four truths.

source: །བདེན་པ་བཞི་པོ་དེ་དག་ཉིད་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་། སྤང་བར་བྱ་བ་དང་། མངོན་སུམ་དུ་བྱ་བ་དང་། བསྒོམ་པར་བྱ་བའི་ལེའུ་ཚིག་ནི་བསྐོར་བ་གཉིས་སོ།
en: The second turning is the part of the speech stating that just those four truths have to be comprehended, eliminated, realized, and cultivated.

source: །བདེན་པ་བཞི་པོ་དེ་དག་ཉིད་བདག་གིས་ཡོངས་སུ་ཤེས་སོ། །སྤངས་སོ། །མངོན་སུམ་དུ་བྱས་སོ། །བསྒོམས་སོ་ཞེས་བྱ་བའི་ལེའུ་ཚིག་ནི་བསྐོར་བ་གསུམ་སྟེ།
en: The third turning is the part of the speech stating that “I have comprehended, eliminated, realized, and cultivated” just those four truths.

source: དེ་དག་ནི་ལན་གསུམ་དུ་བཟླས་ཏེ་བསྐོར་བའོ།
en: Those are the turning three times.

source: །དེ་ལ་སྡུག་བསྔལ་གྱི་བདེན་པ་ལ་སྡུག་བསྔལ་གྱི་ངོ་བོ་ཉིད་དང་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་། ཡོངས་སུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་གསུམ་མོ།
en: For the truth of suffering there are three aspects: the intrinsic nature of suffering, that it has to be comprehended, and that “I have comprehended.”

source: །ཀུན་འབྱུང་བའི་བདེན་པ་ལ་ཡང་ཀུན་འབྱུང་བའི་ངོ་བོ་ཉིད་དང་། སྤང་བར་བྱ་བ་དང་སྤངས་སོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་གསུམ་མོ།
en: For the truth of origination there are three aspects: the intrinsic nature of origination, that it has to be eliminated, and that “I have eliminated it.”

source: །འགོག་པའི་བདེན་པ་ལ་ཡང་འགོག་པའི་ངོ་བོ་ཉིད་དང་། མངོན་སུམ་དུ་བྱ་བ་དང་། མངོན་སུམ་དུ་བྱས་སོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་གསུམ་མོ།
en: For the truth of cessation there are three aspects: the intrinsic nature of cessation, that it has to be realized, and that “I have realized it.”

source: །ལམ་གྱི་བདེན་པ་ལ་ཡང་ལམ་གྱི་ངོ་བོ་ཉིད་དང་། བསྒོམ་པར་བྱ་བ་དང་། བསྒོམས་སོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་གསུམ་སྟེ།
en: And for the truth of the path there are three aspects: the intrinsic nature of the path, that it has to be cultivated, and that “I have cultivated it.”

source: དེ་ལྟར་ན་རྣམ་པ་བཅུ་གཉིས་སོ།
en: Thus, there are twelve aspects. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་བྱ་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་ཐབས་སྔར་བརྒྱ་བྱིན་གྱིས་དྲིས་ཟིན་ལ།
en: Lord, how does one stand in the perfection of wisdom?”

source: བཤད་ཀྱང་ཟིན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་ཐབས་དྲིས་པ་ནི་མ་ཡིན་གྱི།
en: Śatakratu has already asked earlier about the way to stand in the perfection of wisdom, and it has already been explained, so this is not a question about the way to stand in the perfection of wisdom.

source: འདིར་ནི་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་བྱ་བ་ཇི་ལྟར་གུས་ཤིང་འཇར་བས་གནས་པར་བྱ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Here “how does one stand” means this: how, by respecting and serving it, does one stand? “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་སྟོན་པ།
en: The perfection of wisdom is itself the Teacher and the Teacher is himself the perfection of wisdom.”

source: སྟོན་པ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པའི་ཕྱིར་ཐ་དད་པ་མེད་པར་བརྟགས་ཏེ་བསྟན་པའོ།
en: Because it does the work of the Buddha it is envisioned and taught to be not different.

source: །ཤཱ་རིའི་བུས་དྲིས་པ་འདི་ཅི་ལས་བྱུང་གླེང་གཞི་གང་ཡིན་ཞེ་ན།
en: Śatakratu wonders, “What occasioned this inquiry by the venerable monk Śāriputra? What was the catalyst?”

source: དགོས་པ་དེ་ཙམ་གྱིས་མ་མགུ་ནས་རྣམ་པར་རྟོག་པ་སྟེ།
en: because he is not satisfied with just those reasons Śāriputra has given.
